#define UTF8CASES_SIZE 33
wchar_t cases[UTF8CASES_SIZE][2] = {
  { L'А', L'а' }, // А а
  { L'Б', L'б' }, // Б б
  { L'В', L'в' }, // В в
  { L'Г', L'г' }, // Г г
  { L'Д', L'д' }, // Д д
  { L'Е', L'е' }, // Е е
  { L'Ё', L'ё' }, // Ё ё
  { L'Ж', L'ж' }, // Ж ж
  { L'З', L'з' }, // З з
  { L'И', L'и' }, // И и
  { L'Й', L'й' }, // Й й
  { L'К', L'к' }, // К к
  { L'Л', L'л' }, // Л л
  { L'М', L'м' }, // М м
  { L'Н', L'н' }, // Н н
  { L'О', L'о' }, // О о
  { L'П', L'п' }, // П п
  { L'Р', L'р' }, // Р р
  { L'С', L'с' }, // С с
  { L'Т', L'т' }, // Т т
  { L'У', L'у' }, // У у
  { L'Ф', L'ф' }, // Ф ф
  { L'Х', L'х' }, // Х х
  { L'Ц', L'ц' }, // Ц ц
  { L'Ч', L'ч' }, // Ч ч
  { L'Ш', L'ш' }, // Ш ш
  { L'Щ', L'щ' }, // Щ щ
  { L'Ъ', L'ъ' }, // Ъ ъ
  { L'Ы', L'ы' }, // Ы ы
  { L'Ь', L'ь' }, // Ь ь
  { L'Э', L'э' }, // Э э
  { L'Ю', L'ю' }, // Ю ю
  { L'Я', L'я' }, // Я я
};
